tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "k-vernooy/tap"
tap "koekeishiya/formulae"
tap "mscharley/homebrew"
tap "railwaycat/emacsmacport"
brew "aspell"
brew "python@3.9"
brew "htop"
brew "luajit", args: ["HEAD"]
brew "neovim", args: ["HEAD"]
brew "ranger"
brew "ripgrep"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "railwaycat/emacsmacport/emacs-mac", args: ["HEAD", "with-emacs-big-sur-icon", "with-no-title-bars"]
cask "basictex"
cask "firefox"
cask "ubersicht"
