tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "k-vernooy/tap"
tap "koekeishiya/formulae"a
brew "bat"
brew "python@3.9"
brew "pkg-config"
brew "carthage"
brew "cmake"
brew "coreutils"
brew "git-lfs"
brew "libtool"
brew "htop"
brew "luajit", args: ["HEAD"]
brew "make"
brew "ninja"
brew "neovim", args: ["HEAD"]
brew "node"
brew "ranger"
brew "ripgrep"
brew "starship"
brew "zsh-syntax-highlighting"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-elrumo1-icon", "with-native-comp", "with-no-titlebar"]
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
