tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "d12frosted/emacs-plus"
tap "koekeishiya/formulae"

brew "bat"
brew "exa"
brew "htop"
brew "imagemagick"
brew "neofetch"
brew "wget"
brew "yadm"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "aspell"
brew "fish"
brew "gnuplot"
brew "hyperfine"
brew "isync"
brew "msmtp"
brew "mu"
brew "neovim", args: ["HEAD"]
brew "pandoc"
brew "ranger"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-elrumo2-icon", "with-native-comp", "with-xwidgets"]

cask "basictex"
cask "font-sf-pro"
cask "kitty"
cask "wkhtmltopdf"
