tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "d12frosted/emacs-plus"
# tap "koekeishiya/formulae"

brew "bat"
brew "fd"
brew "tree"
brew "git-lfs"
brew "exa"
brew "yadm"
# brew "koekeishiya/formulae/skhd"
# brew "koekeishiya/formulae/yabai"
brew "aspell"
brew "fish"
brew "gnuplot"
brew "isync"
brew "msmtp"
brew "mu"
brew "neovim", args: ["HEAD"]
brew "ripgrep"
brew "tmux"
brew "tectonic"
brew "cmacrae/formulae/spacebar"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-elrumo2-icon", "with-native-comp", "with-xwidgets", "without-imagemagick"]

cask "font-alegreya"
cask "font-overpass"
